import { TBookInfo } from '../types';

export const mockedBooksCatalogue: TBookInfo[] = [
  {
    id: '1',
    title: 'Молот и крест',
    author: 'Гарри Гаррисон',
    cover: 'https://cv9.litres.ru/pub/c/elektronnaya-kniga/cover_415/64455491-garri-garrison-molot-i-krest-64455491.jpg',
    description: 'Молот и Крест (англ. The Hammer and the Cross) — роман в жанре альтернативной истории, написанный Гарри Гаррисоном в соавторстве с Джоном Холмом (псевдоним Тома Шиппи) и опубликованный в 1993 году. Первый роман трилогии (на русском языке некоторыми издательствами выпущена как тетралогия, последний том разбит на две книги)[2]. Книга рассказывает о возвышении главного героя по имени Шеф (Shef), внебрачного сына датского ярла Сигварда и англичанки леди Трит. Время и место повествования — Англия IX в. н. э. ',
    price: 329,
    genre: 'Фэнтези, сага',
  },
  {
    id: '2',
    title: 'Крест и король',
    author: 'Гарри Гаррисон',
    cover: 'https://cv2.litres.ru/pub/c/elektronnaya-kniga/cover_415/122322-garri-garrison-krest-i-korol.jpg',
    description: 'Знаток ремесел, провидец и воин Шеф Сигвардссон поднялся из самых низов, чтобы возглавить могущественный народ викингов. Но его растущее королевство угрожает существованию всей Европы, и он обзавелся множеством опаснейших врагов.  Церковные иерархи и их союзники, фанатики из рыцарского религиозного ордена, поклялись свергнуть Шефа любой ценой. Чтобы исполнить обет, им необходимо раздобыть священное копье, оборвавшее жизнь Христа, и возродить Священную Римскую империю. Повинуясь ниспосланным свыше видениям, Шеф сражается, чтобы изменить ход истории, но кажется, даже сами боги вступили в заговор против него.',
    price: 329,
    genre: 'Фэнтези, сага',
  },
  {
    id: '3',
    title: 'Король и император',
    author: 'Гарри Гаррисон',
    cover: 'https://cv1.litres.ru/pub/c/elektronnaya-kniga/cover_185/65804317-garri-garrison-korol-i-imperator-65804317.jpg',
    description: 'Побеждая в сражениях на суше и на море, исполняя волю богов, что являются в пророческих видениях, человек, поднявшийся из самых низов, становится единым королем северных народов. Шеф, мастер боевых и мирных ремесел, совершил поистине невозможное, заставив вчерашних заклятых врагов прекратить взаимное истребление. Но теперь ему бросает вызов возрожденная Священная Римская империя, которая заключила временный союз с могущественной Византией, чтобы расправиться с загадочным англо-норманнским монархом и расцветающими под его защитой странами. Понимая, что драккары викингов не могут противостоять мечущим греческий огонь галерам, Шеф в поисках равноценного оружия отправляется в новый поход – на Восток, к сокровищнице знаний мусульманской цивилизации.',
    price: 329,
    genre: 'Фэнтези, сага',
  },
  {
    id: '4',
    title: 'Император и молот',
    author: 'Гарри Гаррисон',
    cover: 'https://cv1.litres.ru/pub/c/elektronnaya-kniga/cover_415/122319-garri-garrison-imperator-i-molot.jpg',
    description: 'В своей жизни Шеф Сигвардссон – король Севера, носил и рабский ошейник, и королевскую корону, и амулет богов. Многие священные реликвии, побывав в его руках и выполнив свою миссию, обрели настоящих хозяев. Всем, что знал и умел, он щедро поделился со своими подданными. И последнее, что он должен для них сделать, – это привести их под стены Рима и бросить в смертельную битву, кровавей которой еще не видел мир.',
    price: 329,
    genre: 'Фэнтези, сага',
  },
  {
    id: '5',
    title: 'Братство кольца',
    author: 'Джон Роналд Руэл Толкин',
    cover: 'https://cv6.litres.ru/pub/c/elektronnaya-kniga/cover_415/147165-dzhon-tolkin-bratstvo-kolca.webp',
    description: 'Трилогия «Властелин Колец» – одна из тех великих книг, встреча с которыми становится Событием. Эпическая красота повествования, вечная тема борьбы Добра и Зла, большой подвиг маленького героя и, самое главное, – тот фантастический и вместе с тем удивительно реальный мир, в котором хочется остаться навсегда.\n'
      + '\n'
      + 'Издание, которое вы держите в руках, выполненное в переводе Владимира Грушецкого и Наталии Григорьевой и оформленное знаменитым художником Денисом Гордеевым, – не просто книга на все времена, не просто культовое фэнтези от одного из самых известных писателей, но произведение искусства, сочетающее в себе волшебство слова и рисунка.',
    price: 399,
    genre: 'Фэнтези',
  },
  {
    id: '6',
    title: 'Две крепости',
    author: 'Джон Роналд Руэл Толкин',
    cover: 'https://cv3.litres.ru/pub/c/elektronnaya-kniga/cover_415/20291235-dzhon-tolkin-dve-kreposti.webp',
    description: 'Трилогия «Властелин Колец» – одна из тех великих книг, встреча с которыми становится Событием. Эпическая красота повествования, вечная тема борьбы Добра и Зла, большой, подвиг маленького героя и, самое главное, – тот фантастический, и вместе с тем удивительно реальный мир, в котором хочется остаться навсегда.\n'
      + '\n'
      + 'Издание, которое вы держите в руках, выполненное в переводе Владимира Грушецкого и Наталии Григорьевой и оформленное знаменитым художником Денисом Гордеевым, – не просто книга на все времена, не просто культовое фэнтези от одного из самых известных писателей, но произведение искусства, сочетающее в себе волшебство слова и рисунка.',
    price: 399,
    genre: 'Фэнтези',
  },
  {
    id: '7',
    title: 'Возвращение короля',
    author: 'Джон Роналд Руэл Толкин',
    cover: 'https://cv2.litres.ru/pub/c/elektronnaya-kniga/cover_415/20184823-dzhon-tolkin-vozvraschenie-korolya.webp',
    description: 'Трилогия «Властелин Колец» – одна из тех великих книг, встреча с которыми становится Событием. Эпическая красота повествования, вечная тема борьбы Добра и Зла, большой подвиг маленького героя и, самое главное, – тот фантастический и вместе с тем удивительно реальный мир, в котором хочется остаться навсегда.\n'
      + '\n'
      + 'Издание, которое вы держите в руках, выполненное в переводе Владимира Грушецкого и Наталии Григорьевой и оформленное знаменитым художником Денисом Гордеевым, – не просто книга на все времена, не просто культовое фэнтези от одного из самых известных писателей, но произведение искусства, сочетающее в себе волшебство слова и рисунка.',
    price: 399,
    genre: 'Фэнтези',
  },
  {
    id: '8',
    title: 'Хоббит, или Туда и Обратно',
    author: 'Джон Роналд Руэл Толкин',
    cover: 'https://cv9.litres.ru/pub/c/elektronnaya-kniga/cover_415/43517791-dzhon-tolkin-hobbit-ili-tuda-i-obratno-43517791.webp',
    description: '«В глубокой норе жил-был хоббит». Так начинается одно из лучших детских фантастических произведений всех времен – «Хоббит, или Туда и Обратно» от всемирно известного английского писателя Джона Роналда Руэла Толкина, создателя саги о волшебном мире Средиземья.\n'
      + '\n'
      + 'Впервые опубликованный в 1937 году, «Хоббит» получил широкое признание критиков по всему миру, был номинирован на медаль Карнеги и награжден призом New York Herald Tribune как лучшая юношеская беллетристика. С тех пор эта повесть переиздавалась множество раз. Кстати, именно с хоббита по имени Бильбо Бэггинс началась история масштабного творения Толкина – «Властелина колец».\n'
      + '\n'
      + 'Волшебник Гэндальф обманом вовлекает Бильбо в невероятное путешествие к Одинокой горе и дракону Смаугу Великолепному. Бильбо предстоит долгая дорога в компании гномов под предводительством Торина Дубощита. Хоббиту придется не только пережить опасное приключение, но и кардинально измениться, обрести зрелость, мудрость и понимание, раскрыть авантюрную сторону своей натуры и неоднократно проявить потрясающую смекалку.\n'
      + '\n'
      + 'Отправляйтесь в путь вместе с Бильбо! Читайте иллюстрированное издание «Хоббита» Джона Толкина онлайн или скачайте книгу в подходящем формате на ЛитРес.\n'
      + 'Описание книги\n'
      + '\n'
      + 'Для читателей во всем мире «Хоббит» – это первое знакомство с прекрасным миром Средиземья, населенного эльфами, магами, гномами, драконами и другими удивительными созданиями, которые встречают нас на страницах культовой трилогии «Властелин колец».\n'
      + '\n'
      + '«Хоббит» в переводе Марии Каменкович и Сергея Степанова, с иллюстрациями Дениса Гордеева – настоящее произведение искусства, сочетающее волшебство слова и рисунка.',
    price: 399,
    genre: 'Фэнтези',
  },
  {
    id: '9',
    title: 'Сильмариллион',
    author: 'Джон Роналд Руэл Толкин',
    cover: 'https://cv4.litres.ru/pub/c/elektronnaya-kniga/cover_415/10743047-dzhon-tolkin-silmarillion.webp',
    description: 'И было так:\n'
      + '\n'
      + 'Единый, называемый у эльфов Илуватар, создал Айнур, и они сотворили перед ним Великую Песнь, что стала светом во тьме и Бытием, помещенным среди Пустоты.\n'
      + '\n'
      + 'И стало так:\n'
      + '\n'
      + 'Эльфы – нолдор – создали Сильмарили, самое прекрасное из всего, что только возможно создать руками и сердцем. Но вместе с великой красотой в мир пришли и великая алчность, и великое же предательство…\n'
      + '\n'
      + '«Сильмариллион» – один из масштабнейших миров в истории фэнтези, мифологический канон, который Джон Руэл Толкин составлял на протяжении всей жизни. Свел же разрозненные фрагменты воедино, подготовив текст к публикации, сын Толкина Кристофер. В 1996 году он поручил художнику-иллюстратору Теду Несмиту нарисовать серию цветных произведений для полноцветного издания. Теперь российский читатель тоже имеет возможность приобщиться к великолепной саге.\n'
      + '\n'
      + 'Впервые – в новом переводе Светланы Лихачевой!',
    price: 399,
    genre: 'Фэнтези',
  },
  {
    id: '10',
    title: 'Вспомнить все: Моя невероятно правдивая история',
    author: 'Арнольд Шварценеггер',
    cover: 'https://cv8.litres.ru/pub/c/elektronnaya-kniga/cover_415/4991283-arnold-shvarcenegger-vspomnit-vse-moya-neveroyatno-pravdivaya-istoriya.webp',
    description: 'История его жизни уникальна.\n'
      + '\n'
      + 'Он родился в голодные годы в маленьком австрийском городке, в семье полицейского, не имея особых перспектив на будущее. А в возрасте двадцати одного года он уже жил в Лос-Анджелесе и носил титул «Мистер Вселенная».\n'
      + '\n'
      + 'За пять лет он выучил английский язык и завоевал статус величайшего бодибилдера мира.\n'
      + '\n'
      + 'За десять лет он получил университетское образование и стал миллионером как бизнесмен и спортсмен.\n'
      + '\n'
      + 'За двадцать лет он вошел в число кинозвезд первой величины и породнился с семьей Кеннеди.\n'
      + '\n'
      + 'А через тридцать шесть лет после приезда в Америку он занял пост губернатора Калифорнии…\n'
      + '\n'
      + 'Этот человек – легендарный Арнольд Шварценеггер. И в этой книге он вспомнит действительно все…',
    price: 349,
    genre: 'Биографии, мемуары',
  },
  {
    id: '11',
    title: 'Стив Джобс',
    author: 'Уолтер Айзексон',
    cover: 'https://cv3.litres.ru/pub/c/elektronnaya-kniga/cover_415/2691335-uolter-ayzekson-stiv-dzhobs.webp',
    description: 'В основу этой биографии легли беседы с самим Стивом Джобсом, а также с его родственниками, друзьями, врагами, соперниками и коллегами. Джобс никак не контролировал автора. Он откровенно отвечал на все вопросы и ждал такой же честности от остальных. Это рассказ о жизни, полной падений и взлетов, о сильном человеке и талантливом бизнесмене, который одним из первых понял: чтобы добиться успеха в XXI веке, нужно соединить креативность и технологии.',
    price: 399,
    genre: 'Зарубежная публицистика',
  },
];
